Repository: TheSawkit/BridgeMark
Catalog: Sources/BridgeMark/Localizable.xcstrings
Source language: fr
Languages: en

# app.tagline
source: Exporte les favoris de Safari vers le navigateur de ton choix. Safari n'est jamais modifié.
en: Export Safari bookmarks to any browser. Safari is never modified.

# error.browser.not.installed %@
source: %@ n'est pas installé.
en: %@ is not installed.

# error.browser.open %@
source: %@ est ouvert. Ferme-le avant de synchroniser.
en: %@ is open. Close it before syncing.

# error.invalid.structure %@
source: Structure invalide pour %@.
en: Invalid structure for %@.

# error.permission.denied
source: Accès refusé aux favoris Safari. BridgeMark a besoin de l'Accès complet au disque.
en: Access denied to Safari bookmarks. BridgeMark needs Full Disk Access.

# error.read.failure %@
source: Impossible de lire : %@
en: Could not read: %@

# error.write.failure %@
source: Impossible d'écrire : %@
en: Could not write: %@

# no.browsers.detected
source: Aucun navigateur compatible détecté (Brave, Chrome, Edge, Opera, Vivaldi, Arc).
en: No compatible browser detected (Brave, Chrome, Edge, Opera, Vivaldi, Arc).

# notif.error.title
source: Erreur de synchronisation
en: Sync error

# notif.success.title
source: Synchronisation réussie
en: Sync successful

# open.system.settings.fda
source: Ouvrir Réglages Système → Accès complet au disque
en: Open System Settings → Full Disk Access

# overwrite.confirm.cancel
source: Annuler
en: Cancel

# overwrite.confirm.destructive
source: Écraser
en: Overwrite

# overwrite.confirm.message %@
source: Tous les favoris dans la barre de %@ seront supprimés et remplacés par ceux de Safari. Un backup horodaté est créé automatiquement.
en: All bookmarks in %@'s bar will be deleted and replaced with Safari's. A timestamped backup is created automatically.

# overwrite.confirm.title %@
source: Écraser les favoris de %@ ?
en: Overwrite %@'s bookmarks?

# overwrite.warning %@
source: Le mode Écraser supprime et remplace intégralement la barre de favoris de %@. Un backup automatique est créé avant l'opération.
en: Overwrite mode deletes and replaces all bookmarks in %@'s bar. A timestamped backup is created automatically.

# permission.alert.later
source: Plus tard
en: Later

# permission.alert.message
source: BridgeMark a besoin de l'accès complet au disque pour lire les favoris Safari. Ouvre les Réglages Système pour autoriser l'accès.
en: BridgeMark needs Full Disk Access to read Safari bookmarks. Open System Settings to grant permission.

# permission.alert.open
source: Ouvrir les Réglages Système
en: Open System Settings

# permission.alert.title
source: Accès complet au disque requis
en: Full Disk Access required

# picker.browser.label
source: Navigateur
en: Browser

# picker.strategy.label
source: Stratégie
en: Strategy

# safari.menu.folder
source: Favoris Safari
en: Safari Favorites

# unnamed.folder
source: Dossier
en: Folder

# status.ready
source: Prêt.
en: Ready.

# status.syncing
source: Synchronisation en cours…
en: Syncing…

# strategy.merge
source: Fusionner
en: Merge

# strategy.overwrite
source: Écraser
en: Overwrite

# sync.button %@
source: Synchroniser vers %@
en: Sync to %@

# sync.report %@ %@ %lld
source: Safari → %1$@ terminé (%2$@). %3$lld élément(s) à la racine.
en: Safari → %1$@ done (%2$@). %3$lld item(s) at root.

# sync.verb.merge
source: fusion
en: merge

# sync.verb.overwrite
source: écrasement
en: overwrite
